PATH_LOGS_PIPLINE = "logs/pipline"
PATH_LOGS_GET_NUM = "logs/logs_get_num"
PATH_LOGS_PARSING_CONTRACT = "logs/parsing_contract"
PATH_LOGS_PARSING_ORG = "logs/parsing_org"
PATH_LOGS_PROCESSING = "logs/processing"

PATH_LOGS_SUCСESS_CONTRACT = "logs/success/contract"
PATH_LOGS_SUCСESS_ORG = "logs/success/org"
PATH_LOGS_SUCСESS_GET_NUM = "logs/success/get_number"
PATH_LOGS_SUCСESS_EXTRACT_CODE = "logs/success/extract_code"
PATH_LOGS_SUCСESS_PROCESSING_CONTRACT = "logs/success/processing/contract"
PATH_LOGS_SUCСESS_PROCESSING_ORG = "logs/success/processing/org"
PATH_LOGS_SUCCESS_MAKE_CAHCE_CODE_ID = "logs/success/make_cahce_code_id"

PATH_LOGS_PROBLEM_CONTRACT = "logs/problem/contract"
PATH_LOGS_PROBLEM_ORG = "logs/problem/org"

PATH_DATA_FROM_SPENDGOV = "data/data_from_spendgov/"
PATH_NUMBERS = "data/contract_number/numbers"
PATH_CODE_ID = "data/contract_number/code_id"
PATH_SPLIT_DATA_CONTRACT = "data/contract_number/split_data/contract"
PATH_SPLIT_DATA_CODE = "data/contract_number/split_data/code"
PATH_RAW_DATA_CONTRACT = "data/raw_data/contract/"
PATH_RAW_DATA_ORG = "data/raw_data/org/"
PATH_PROCESSING_DATA_CONTRACT = "data/processed_data/contract"
PATH_PROCESSING_DATA_ORG = "data/processed_data/org"

PATH_PROXY_LIST = "data/proxy.csv"
PATH_KBK_TABLE = "data/kbk.xlsx"

PATH_CACHE_CODE_ID = "data/cache/cache_code_id.csv"
PATH_CACHE_ADDRESS = "data/cache/cache_address.csv"
PATH_CACHE_ORG_ADDRESS = "data/cache/cache_org_address.csv"


# массивы и словари для обработки данных
dict_month = {
    "января": "01",
    "февраля": "02",
    "марта": "03",
    "апреля": "04",
    "мая": "05",
    "июня": "06",
    "июля": "07",
    "августа": "08",
    "сентября": "09",
    "октября": "10",
    "ноября": "11",
    "декабря": "12",
}
list_local = ["муниципальный уровень", "местный бюджет"]
list_sub = [
    "уровень субъекта рф",
    "бюджет субъекта российской федерации",
    "бюджет территориального государственного внебюджетного фонда",
    "бюджет территориального государственного внебюджетного фонда",
]
list_fed = [
    "федеральный уровень",
    "федеральный бюджет",
    "бюджет пенсионного фонда российской федерации",
    "бюджет федерального фонда обязательного медицинского страхования",
    "бюджет фонда социального страхования российской федерации",
]

list_fed_2 = [
    "войскавая",
    "войсковая",
    "воениз",
    "федеральн",
    "район водных путей и судоходства",
    "следвест",
    "пенсион",
    "росган",
    "фгбу",
    "всероссийс",
    " фбу",
    "прокурату",
    "университ",
    "научно-исследователь",
    "государственное научное учреждение",
    "росграниц",
    "российской академии наук",
    "внутренних дел",
    "мвд",
    "суд",
    "управление министерства промышленности",
    "торговли российской федерации",
    "таможенный пост",
    "российской федерации",
    "таможня",
    "таможенного",
    "российская академия образования",
    "российская академия образования",
    "российская академия художеств",
]

list_local_2 = [
    "городская администрация",
    "муниципал",
    "школа",
    "детский сад",
    "городского поселения",
    "городского округа",
    "администрация рабочего поселка",
    "совет",
    "управление образованием администрации г",
    "поселок",
    "поселк",
    "частное учереждение",
    "администрации зато",
    "администрация пгт",
    "территориальная избирательная комиссия",
    "районный исполнительный комитет",
]
list_sub_2 = [
    "центр занятости населения",
    "област",
    "республи",
    "края",
    "край",
    "краев",
    "города",
    "автоном",
    "oбластное",
    "здравоохране",
    "больниц",
    "родильный дом",
    "профессиональн",
    "детский дом",
    "дом-интернат",
    "социальн",
    "поликлиник",
    "больниц",
    "государственное бюджетное общеобразовательное учреждение",
    "государственное бюджетное образовательное учреждение",
    "медико-санитарная часть",
    "московское государственное унитарное предприятие",
    "учреждение культуры города",
    "государственное бюджетное учреждение культуры",
    "центр социального обслуживания",
    "социального обслуживания граждан",
    "стоматологическая поликлиника",
    "центр для детей-сирот и детей",
    "санкт-петербур",
    "фонд социального страхования российской федерации",
    "государственное бюджетное учреждение",
    "инспекция труда",
    "региональный",
]
list_anothe = [
    "акционерное общество",
    "завод",
    "акционерное московское общество",
    "общество с ограниченной ответственностью",
    "частное",
    "комбинат",
    "ооо ",
]
list_fed_3 = []
list_sub_3 = ["ветеринар", "колледж"]
list_local_3 = [
    "района",
    "сельск",
    "районное управление образованием",
    "районное бюджетное учреждение",
    "мбу ",
    "городской Исполнительный комитет",
    "городская избирательная комиссия",
]

inn_sub = {
    "7727795994": 'Государственное бюджетное научное учреждение "Московский институт развития образования"',  # noqa
    "4205050521": 'государственное учреждение "Кузбасспассажиравтотранс"',
    "1001036026": 'БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ "ЦЕНТР КУЛЬТУРНЫХ ИНИЦИАТИВ" (АГЕНТСТВО "КУЛЬТУРНАЯ СЕТЬ КАРЕЛИИ")',  # noqa
    "2309102153": "ГУП КК Кубаньфармация",
}
inn_fed = {
    "7704193182": "Региональное оперативно-поисковое управление",
    "6672239827": 'ЛИНЕЙНЫЙ ОТДЕЛ МИНИСТЕРСТВА ВНУТРЕННИХ ДЕЛ РОССИЙСКОЙ ФЕДЕРАЦИИ В АЭРОПОРТУ "КОЛЬЦОВО',  # noqa
}
inn_mun = {
    "3509009509": 'БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ "КОММУНАЛЬЩИК"',
    "3511005766": 'БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ КУЛЬТУРЫ "КИРИЛЛОВСКИЙ КИНОДОСУГОВЫЙ ЦЕНТР"',
    "4506004871": "Управление по делам образования, культуры, молодежи и спорта",
}
inn_another = {"1633002328": 'ДЕТСКИЙ ОЗДОРОВИТЕЛЬНЫЙ ЛАГЕРЬ "ЧАЙКА"'}

name_for_result = ["местный", "субъектовый", "федеральный", "иное"]
